src/Catalogs/ВариантыДампов/ВариантыДампов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыДампов</name>
  <predefined>
    <items>
      <name>ДляЗавершенияБезОбразованияДампа</name>
      <description>Используется для обозначения процесса, завершившегося без образования дампа</description>
    </items>
  </predefined>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>CatalogRef.ВерсииПлатформы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДампа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДополнительноСохраняемыхДампов</name>
    <comment>Количество дампов, которые необходимо сохранить дополнительно к уже собранным</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОшибки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Процесс</name>
    <type>
      <types>EnumRef.Процессы</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатыИРекомендации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Смещение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияВариантаДампа</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИзменилось</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьВсеДампы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Хеш</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СохраненныеДампы</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаличиеФайла</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОбнаружения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/СостоянияОбработкиДампа/СостоянияОбработкиДампа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОбработкиДампа</name>
  <enumValues>
    <name>Архивируется</name>
  </enumValues>
  <enumValues>
    <name>ДампНеНайден</name>
  </enumValues>
  <enumValues>
    <name>ДампОбработанПользователем</name>
  </enumValues>
  <enumValues>
    <name>ДампОбработанУспешно</name>
  </enumValues>
  <enumValues>
    <name>ДампУдаленБезОбработки</name>
  </enumValues>
  <enumValues>
    <name>ЗавершеноАрхивирование</name>
  </enumValues>
  <enumValues>
    <name>ЗавершеноАрхивированиеДампУдален</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрированоСозданиеДампа</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрированоСозданиеДампаАгентом</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрированоСозданиеДампаДляУдаления</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрированоСозданиеДампаДляУдаленияАгентом</name>
  </enumValues>
  <enumValues>
    <name>КопируетсяАрхив</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаДампа</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаАрхивирования</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаПопыткиАрхивирования</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаПопыткиЭкспорта</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаСозданияДампа</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаСозданияДампУдален</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаУдаленияДампа</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаЭкспорта</name>
  </enumValues>
  <enumValues>
    <name>УдалениеФайлаДампа</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортДампа</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ВариантыДампов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПроверитьНаличиеФайловДампов(Знач ПараметрыЗадания, Знач АдресХранилища) Экспорт
	ФайлыДампов = ПараметрыЗадания.ПроверяемыеДампы;
	Для ТекФайл = 0 По ФайлыДампов.Количество() - 1 Цикл
		Файлы = НайтиФайлы(ФайлыДампов[ТекФайл].ИмяФайла);	
		ФайлыДампов[ТекФайл].НаличиеФайла = Файлы.Количество() <> 0;
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ФайлыДампов, АдресХранилища);
КонецПроцедуры

Процедура ПриИзмененииЗаписиДампа(ВариантДампа, СостояниеОбработки) Экспорт
	
	Если НЕ ВариантДампа.СохранятьВсеДампы Тогда
		СостоянияОшибки = Новый Соответствие;
		СостоянияОшибки.Вставить(Перечисления.СостоянияОбработкиДампа.ДампНеНайден, Истина);
		СостоянияОшибки.Вставить(Перечисления.СостоянияОбработкиДампа.ОшибкаАрхивирования, Истина);
		СостоянияОшибки.Вставить(Перечисления.СостоянияОбработкиДампа.ОшибкаСозданияДампУдален, Истина);
		СостоянияОшибки.Вставить(Перечисления.СостоянияОбработкиДампа.ОшибкаЭкспорта, Истина);
		
		Если СостоянияОшибки[СостояниеОбработки] <> Неопределено Тогда
			ВариантДампаОбъект = ВариантДампа.ПолучитьОбъект();
			ВариантДампаОбъект.КоличествоДополнительноСохраняемыхДампов = ВариантДампаОбъект.КоличествоДополнительноСохраняемыхДампов + 1;
			ВариантДампаОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

#КонецЕсли
